SP8EBC/ParaTNC/system/src/drivers/l4/serial_stm32l4x.c
#include "drivers/serial.h"

#include "station_config.h"
#include "station_config_target_hw.h"

#include "kiss_communication/kiss_communication_defs.h"

#include "main.h" // global_time is here

#include <string.h>

#include <stm32l4xx.h>
#include <stm32l4xx_ll_dma.h>
#include <stm32l4xx_ll_gpio.h>
#include <stm32l4xx_ll_usart.h>

#ifdef SEPARATE_TX_BUFF
uint8_t srl_usart1_tx_buffer[TX_BUFFER_1_LN] = {'\0'};
#endif

#ifdef SEPARATE_RX_BUFF
uint8_t srl_usart1_rx_buffer[RX_BUFFER_1_LN] = {'\0'};
#endif

#ifdef SEPARATE_TX_BUFF
uint8_t srl_usart2_tx_buffer[TX_BUFFER_2_LN] = {'\0'};
#endif

#ifdef SEPARATE_RX_BUFF
uint8_t srl_usart2_rx_buffer[RX_BUFFER_2_LN] = {'\0'};
#endif

uint8_t srl_usart3_tx_buffer[TX_BUFFER_3_LN] = {'\0'};
uint8_t srl_usart3_rx_buffer[RX_BUFFER_3_LN] = {'\0'};

void srl_init (srl_context_t *ctx, USART_TypeDef *port, uint8_t *rx_buffer, uint16_t rx_buffer_size,
			   uint8_t *tx_buffer, uint16_t tx_buffer_size, uint32_t baudrate, uint8_t stop_bits)
{

	if (ctx->srl_rx_state == SRL_RX_IDLE)
		return;

// point to internal buffers by default
#ifdef SEPARATE_TX_BUFF
	ctx->srl_tx_buf_pointer = tx_buffer;
	ctx->srl_rx_buf_ln = tx_buffer_size;
#endif

#ifdef SEPARATE_RX_BUFF
	ctx->srl_rx_buf_pointer = rx_buffer;
	ctx->srl_tx_buf_ln = rx_buffer_size;
#endif

	ctx->srl_tx_internal_buf_pointer = tx_buffer;
	ctx->srl_tx_internal_buf_ln = tx_buffer_size;

	memset (ctx->srl_rx_buf_pointer, 0x00, ctx->srl_rx_buf_ln);
	memset (ctx->srl_tx_buf_pointer, 0x00, ctx->srl_tx_buf_ln);

	ctx->port = port;
	ctx->port_baurate = baudrate;
	ctx->port_stopbits = stop_bits;

	// ctx->te_port = 0;
	// ctx->te_pin = 0;

	ctx->srl_tx_start_time = 0xFFFFFFFFu;

	LL_USART_InitTypeDef USART_InitStructure;

	USART_InitStructure.BaudRate = baudrate;
	USART_InitStructure.DataWidth = LL_USART_DATAWIDTH_8B;
	USART_InitStructure.StopBits = LL_USART_STOPBITS_1;
	USART_InitStructure.Parity = LL_USART_PARITY_NONE;
	USART_InitStructure.TransferDirection = LL_USART_DIRECTION_RX;
	USART_InitStructure.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
	USART_InitStructure.OverSampling = LL_USART_OVERSAMPLING_16;

	const ErrorStatus init_res = LL_USART_Init (port, &USART_InitStructure);

	if (init_res != SUCCESS) {
		ctx->srl_rx_state = SRL_RX_ERROR;
		return;
	}

	if (port == USART1) {
		NVIC_EnableIRQ (USART1_IRQn);
	}
	else if (port == USART2) {
		NVIC_EnableIRQ (USART2_IRQn);
	}
	else if (port == USART3) {
		NVIC_EnableIRQ (USART3_IRQn);
	}

	port->CR1 |= USART_CR1_UE;
	port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);

	ctx->srl_rx_state = SRL_RX_IDLE;
	ctx->srl_tx_state = SRL_TX_IDLE;
	ctx->srl_tx_with_dma = 0;

	ctx->srl_rx_error_reason = SRL_ERR_NONE;

	ctx->srl_rx_timeout_calc_started = 0;
	ctx->total_idle_counter = 0;
	ctx->total_overrun_counter = 0;

	ctx->srl_rx_start_time = 0;
	ctx->srl_rx_waiting_start_time = 0;

	ctx->srl_rx_timeout_enable = 0;
	ctx->srl_rx_timeout_waiting_enable = 0;

	ctx->srl_rx_kiss_mode = 0;
	ctx->srl_rx_kiss_escaping_now = 0;

	// ctx->srl_rx_done_or_error = 0;
	ctx->srl_rx_term = 0;
}

static void srl_init_dma_helper (uint8_t *tx_buffer,
								 uint32_t tx_buffer_size, USART_TypeDef *port)
{
	LL_DMA_InitTypeDef DMA_InitStruct;
	LL_DMA_StructInit(&DMA_InitStruct);

	DMA_InitStruct.Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
	DMA_InitStruct.Mode = LL_DMA_MODE_NORMAL;
	DMA_InitStruct.NbData = tx_buffer_size;
	DMA_InitStruct.MemoryOrM2MDstAddress = (uint32_t)tx_buffer;
	DMA_InitStruct.MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE;
	DMA_InitStruct.MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
	// DMA_InitStruct.PeriphOrM2MSrcAddress = (uint32_t)tx_buffer;
	DMA_InitStruct.PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE;
	DMA_InitStruct.PeriphOrM2MSrcIncMode = LL_DMA_PERIPH_NOINCREMENT;

	if (port == USART1) {
		DMA_InitStruct.PeriphOrM2MSrcAddress = (uint32_t)&USART1->TDR;
		DMA_InitStruct.PeriphRequest = LL_DMA_REQUEST_2;
		LL_DMA_DeInit (DMA1, LL_DMA_CHANNEL_4);
		LL_DMA_Init (DMA1, LL_DMA_CHANNEL_4, &DMA_InitStruct);
		LL_DMA_EnableIT_TC (DMA1, LL_DMA_CHANNEL_4);
		LL_DMA_EnableChannel (DMA1, LL_DMA_CHANNEL_4);
		LL_USART_EnableDMAReq_TX (USART1);
		NVIC_EnableIRQ (DMA1_Channel4_IRQn);
	}
	else if (port == USART2) {
		DMA_InitStruct.PeriphOrM2MSrcAddress = (uint32_t)&USART2->TDR;
		DMA_InitStruct.PeriphRequest = LL_DMA_REQUEST_2;
		LL_DMA_DeInit (DMA1, LL_DMA_CHANNEL_7);
		LL_DMA_Init (DMA1, LL_DMA_CHANNEL_7, &DMA_InitStruct);
		LL_DMA_EnableIT_TC (DMA1, LL_DMA_CHANNEL_7);
		LL_DMA_EnableChannel (DMA1, LL_DMA_CHANNEL_7);
		NVIC_EnableIRQ (DMA1_Channel7_IRQn);
	}
	else if (port == USART3) {
		DMA_InitStruct.PeriphOrM2MSrcAddress = (uint32_t)&USART3->TDR;
		DMA_InitStruct.PeriphRequest = LL_DMA_REQUEST_2;
		LL_DMA_DeInit (DMA1, LL_DMA_CHANNEL_2);
		LL_DMA_Init (DMA1, LL_DMA_CHANNEL_2, &DMA_InitStruct);
		LL_DMA_EnableIT_TC (DMA1, LL_DMA_CHANNEL_2);
		LL_DMA_EnableChannel (DMA1, LL_DMA_CHANNEL_2);
		NVIC_EnableIRQ (DMA1_Channel2_IRQn);
	}
}

void srl_init_dma (srl_context_t *ctx, USART_TypeDef *port, uint8_t *rx_buffer,
				   uint16_t rx_buffer_size, uint8_t *tx_buffer, uint16_t tx_buffer_size,
				   uint32_t baudrate, uint8_t stop_bits)
{

	// firstly do regular initialization
	srl_init (ctx, port, rx_buffer, rx_buffer_size, tx_buffer, tx_buffer_size, baudrate, stop_bits);

	srl_init_dma_helper (tx_buffer, tx_buffer_size, port);

	ctx->srl_tx_with_dma = 1;

	port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
	port->ISR &= (0xFFFFFFFF ^ USART_ISR_TXE);
}

void srl_reset (srl_context_t *ctx)
{
	ctx->srl_rx_state = SRL_RX_IDLE;
	ctx->srl_tx_state = SRL_TX_IDLE;

	ctx->srl_rx_error_reason = SRL_ERR_NONE;

	ctx->srl_rx_timeout_calc_started = 0;
	ctx->total_idle_counter = 0;
	ctx->total_overrun_counter = 0;

	ctx->srl_rx_start_time = 0;
	ctx->srl_rx_waiting_start_time = 0;

	// ctx->srl_rx_timeout_enable = 0;
	ctx->srl_rx_timeout_waiting_enable = 0;
	ctx->srl_rx_kiss_mode = 0;
	ctx->srl_rx_kiss_escaping_now = 0;
}

void srl_close (srl_context_t *ctx)
{
	LL_USART_DeInit (ctx->port);

