SP8EBC/ParaTNC/system/src/drivers/l4/serial_stm32l4x.c
	if (ctx->te_port != NULL && ctx->te_pin != 0) {
		LL_GPIO_ResetOutputPin (ctx->te_port, ctx->te_pin);
	}

	ctx->srl_rx_state = SRL_RX_NOT_CONFIG;
	ctx->srl_tx_state = SRL_TX_NOT_CONFIG;
}

// this function shall be called in 10ms periods by some timer to check the timeout
// during receive. This method works differently depends on what receive mode was initiaded
//
// if start & stop characters are in use the timeout will be calculted from the time when
// start character was received and operation mode has been switched from SRL_WAITING_TO_RX
// to SRL_RXING
//
// if no start & stop character is used by software timeout is calculated from the time when
// first character was received after calling srl_receive_data
void srl_keep_timeout (srl_context_t *ctx)
{
	if (ctx->srl_rx_state != SRL_RX_NOT_CONFIG && ctx->srl_rx_timeout_enable == 1) {

		// checking if flag to check a timeout is raised
		if (ctx->srl_rx_timeout_calc_started == 1) {

			// check if timeout expired
			if (master_time - ctx->srl_rx_start_time > ctx->srl_rx_timeout_trigger_value_in_msec) {
				// disable the receiving part of UART, disable interrupt and switch to an error
				// state
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_RE);
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_RXNEIE);

				ctx->srl_rx_state = SRL_RX_ERROR;

				ctx->srl_rx_error_reason = SRL_ERR_TIMEOUT_RECEIVING;

				if (ctx->srl_rx_done_or_error != 0) {
					ctx->srl_rx_done_or_error (ctx);
				}
			}
		}
	}
	else {
		;
	}

	if ((ctx->srl_rx_state == SRL_WAITING_TO_RX || ctx->srl_rx_state == SRL_RXING) &&
		ctx->srl_rx_timeout_waiting_enable == 1) {
		if (master_time - ctx->srl_rx_waiting_start_time >
			ctx->srl_rx_timeout_trigger_value_in_msec) {
			ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_RE);
			ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_RXNEIE);

			ctx->srl_rx_state = SRL_RX_ERROR;

			ctx->srl_rx_error_reason = SRL_ERR_TIMEOUT_WAITING;

			if (ctx->srl_rx_done_or_error != 0) {
				ctx->srl_rx_done_or_error (ctx);
			}
		}
	}
}

uint8_t srl_send_data (srl_context_t *ctx, const uint8_t *data, uint8_t mode, uint16_t leng,
					   uint8_t internal_external)
{
	if (ctx->srl_tx_state == SRL_TXING)
		return SRL_BUSY;

	/* Wesja z dnia 04.09.2013

		char* data - wskaznik na tablice z danymi do przeslania
		char mode - tryb pracy ktory okresla czy ma wysylac okreslona liczbe znakow
					czy wysylac wszystko do napotkania 0x00
		short leng - ilosc znakow do wyslania istotna tylko gdy mode = 1
		internal_external - ustawienie 0 spowoduje skopiowanie do wewnentrznego bufora i wysylanie z
	   niego jedynka spowoduje wysylanie bezposrednio z wewnetrznego
		 */
	int i;

	// the bytes counter needs to be set to 1 as the first byte is sent in this function
	ctx->srl_tx_bytes_counter = 1;

	// if an user want to send data using internal buffer
	if (internal_external == 0) {

		// if data at the input is too long to fit in the buffer
		if (leng >= ctx->srl_rx_buf_ln)
			return SRL_DATA_TOO_LONG;

		// setting a pointer to transmit buffer to the internal buffer inside the driver
		ctx->srl_tx_buf_pointer = ctx->srl_tx_internal_buf_pointer;

		ctx->srl_tx_buf_ln = ctx->srl_tx_internal_buf_ln;

		// cleaning the buffer from previous content
		memset (ctx->srl_tx_buf_pointer, 0x00, ctx->srl_tx_buf_ln);

		// copying the data from provided pointer to internal buffer
		if (mode == 0) {
			// copying everything till the 0x00 is spoted or till the buffer border is reached
			for (i = 0; (i < TX_BUFFER_1_LN && *(data + i) != '\0'); i++)
				ctx->srl_tx_buf_pointer[i] = data[i];
			ctx->srl_tx_bytes_req = i;
		}
		else if (mode == 1) {
			// we don't need to check against buffer size because this was confirmed already
			for (i = 0; i <= leng; i++)
				ctx->srl_tx_buf_pointer[i] = data[i];
			ctx->srl_tx_bytes_req = leng;
		}
	}
	else if (internal_external == 1) {
		ctx->srl_tx_buf_pointer = data;
		ctx->srl_tx_bytes_req = leng;
		ctx->srl_tx_buf_ln = leng;
	}
	else
		return SRL_WRONG_BUFFER_PARAM;

	if (ctx->te_port != 0 && ctx->early_tx_assert != 0) { // added in commit 8d0dd57
		LL_GPIO_SetOutputPin (ctx->te_port, ctx->te_pin);
	}
	if (ctx->srl_tx_with_dma == 1) {

		ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
		ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TXE);

		srl_init_dma_helper (ctx->srl_tx_buf_pointer,
							 ctx->srl_tx_bytes_req,
							 ctx->port);

		// enabling transmitter
		ctx->port->CR1 |= USART_CR1_TE;
		ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
		ctx->port->TDR = ctx->srl_tx_buf_pointer[0];
		ctx->srl_tx_state = SRL_TXING;
		ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_TXEIE);
		ctx->port->CR1 |= USART_CR1_TCIE;

		return SRL_OK;
	}

	// enabling transmitter
	ctx->port->CR1 |= USART_CR1_TE;
	ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
	ctx->port->TDR = ctx->srl_tx_buf_pointer[0];
	ctx->srl_tx_state = SRL_TXING;
	ctx->port->CR1 |= USART_CR1_TXEIE; // przerwanie zg�aszane kiedy rejsetr DR jest pusty
	ctx->port->CR1 |= USART_CR1_TCIE;  // przerwanie zg�aszane po transmisji bajtu
									   // je�eli rejestr DR jest nadal pusty

	return SRL_OK;
}

/**
 * This function assumes than
 */
uint8_t srl_start_tx (srl_context_t *ctx, short leng)
{
	if (ctx->srl_tx_state == SRL_TXING)
		return SRL_BUSY;

	// if data at the input is too long to fit in the buffer
	if (leng >= ctx->srl_rx_buf_ln)
		return SRL_DATA_TOO_LONG;

	if (leng == 0)
		return SRL_WRONG_PARAMS_COMBINATION;

	ctx->srl_tx_bytes_req = leng;

	// setting a pointer to transmit buffer to the internal buffer inside the driver
	// ctx->srl_tx_buf_pointer = srl_usart1_tx_buffer;

	if (ctx->te_port != 0 && ctx->early_tx_assert != 0) { // // added in commit 8d0dd57
		LL_GPIO_SetOutputPin (ctx->te_port, ctx->te_pin);
	}

	// check if delay should be applied to transmission
	if (ctx->srl_tx_start_time == 0xFFFFFFFFu) {
		if (ctx->srl_tx_with_dma == 1) {

			ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
			ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TXE);

			srl_init_dma_helper (ctx->srl_tx_buf_pointer,
								 ctx->srl_tx_bytes_req,
								 ctx->port);

			// enabling transmitter
			ctx->port->CR1 |= USART_CR1_TE;
			ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
			ctx->port->TDR = ctx->srl_tx_buf_pointer[0];
			ctx->srl_tx_state = SRL_TXING;
			ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_TXEIE);
			ctx->port->CR1 |= USART_CR1_TCIE;
		}
		else {

			// 0xFFFFFFFF is a magic number which disables the pre-tx delay
			ctx->port->CR1 |= USART_CR1_TE;
			ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
			ctx->port->TDR = ctx->srl_tx_buf_pointer[0];

			// the bytes counter needs to be set to 1 as the first byte is sent in this function
			ctx->srl_tx_bytes_counter = 1;

			ctx->srl_tx_state = SRL_TXING;

