SP8EBC/ParaTNC/system/src/drivers/l4/serial_stm32l4x.c
			ctx->port->CR1 |= USART_CR1_TXEIE;
			ctx->port->CR1 |= USART_CR1_TCIE;
		}
	}
	else {
		ctx->srl_tx_state = SRL_TX_WAITING;
		ctx->srl_tx_start_time = main_get_master_time ();
	}

	return SRL_OK;
}

void srl_wait_for_tx_completion (srl_context_t *ctx)
{
	while (ctx->srl_tx_state != SRL_TX_IDLE && ctx->srl_tx_state != SRL_TX_ERROR)
		;
}

uint8_t srl_wait_for_rx_completion_or_timeout (srl_context_t *ctx, uint8_t *output)
{

	*output = SRL_UNINITIALIZED;

	// block the execution until the
	while (ctx->srl_rx_state != SRL_RX_DONE && ctx->srl_rx_state != SRL_RX_ERROR)
		;

	switch (ctx->srl_rx_state) {
	case SRL_RX_DONE: {
		*output = SRL_OK;
		break;
	}

	case SRL_RX_ERROR: {
		*output = SRL_TIMEOUT;
		break;
	}

	default: {
		break;
	}
	}

	return *output;
}

uint8_t srl_receive_data (srl_context_t *ctx, int num, char start, char stop, char echo,
						  char len_addr, char len_modifier)
{
	if (ctx->srl_rx_state == SRL_RXING)
		return SRL_BUSY;

	// trace_printf("Serial:SrlReceiveData()\r\n");

	if (num >= ctx->srl_rx_buf_ln)
		return SRL_DATA_TOO_LONG;

	memset (ctx->srl_rx_buf_pointer, 0x00, ctx->srl_rx_buf_ln);

	ctx->srl_rx_error_reason = SRL_ERR_NONE;

	ctx->srl_rx_kiss_mode = 0;
	ctx->srl_rx_kiss_escaping_now = 0;

	// checking if user want
	if (start != 0x00) {
		ctx->srl_triggered_start = 1;
		ctx->srl_start_trigger = start;
	}
	else {
		ctx->srl_triggered_start = 0;
		ctx->srl_start_trigger = 0;
	}

	if (stop != 0x00) {
		ctx->srl_triggered_stop = 1;
		ctx->srl_stop_trigger = stop;
	}
	else {
		ctx->srl_triggered_stop = 0;
		ctx->srl_stop_trigger = 0;
	}

	if (ctx->srl_triggered_start == 1 /*|| ctx->srl_triggered_stop == 1*/) {
		if (num < 3)
			return SRL_WRONG_PARAMS_COMBINATION;

		ctx->srl_rx_state = SRL_WAITING_TO_RX;
		ctx->srl_rx_waiting_start_time = master_time;
	}
	else {
		ctx->srl_rx_state = SRL_RXING;
	}

	ctx->srl_enable_echo = echo;
	ctx->srl_rx_bytes_counter = 0;
	ctx->srl_rx_bytes_req = num;

	if (len_addr != 0) {
		ctx->srl_rx_lenght_param_addres = len_addr;
	}
	else {
		ctx->srl_rx_lenght_param_addres = num + 1;
	}
	ctx->srl_rx_lenght_param_modifier = len_modifier;

	ctx->srl_rx_timeout_calc_started = 0;

	ctx->port->CR1 |= USART_CR1_RE;		// uruchamianie odbiornika
	ctx->port->CR1 |= USART_CR1_RXNEIE; // przerwanie od przepe�nionego bufora odbioru
	ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_IDLEIE);
	// 	PORT->CR1 |= USART_CR1_IDLEIE;			// przerwanie od bezczynno�ci szyny RS przy odbiorze
	// spowodowanej zako�czeniem transmisji przez urz�dzenie
	return SRL_OK;
}

/**
 * Triggers reception of KISS protocol data
 * @param ctx pointer to serial port context
 * @param num maximum frame lenght to be received
 * @return
 */
uint8_t srl_receive_data_kiss_protocol (srl_context_t *ctx, int num)
{
	if (ctx->srl_rx_state == SRL_RXING)
		return SRL_BUSY;

	if (num >= ctx->srl_rx_buf_ln)
		return SRL_DATA_TOO_LONG;

	// clear the rx buffer
	memset (ctx->srl_rx_buf_pointer, 0x00, ctx->srl_rx_buf_ln);

	ctx->srl_rx_kiss_mode = 1;
	ctx->srl_rx_kiss_escaping_now = 0;

	ctx->srl_triggered_start = 1;
	ctx->srl_start_trigger = FEND;

	ctx->srl_triggered_stop = 1;
	ctx->srl_stop_trigger = FEND;

	ctx->srl_enable_echo = 0;
	ctx->srl_rx_bytes_counter = 0;
	ctx->srl_rx_bytes_req = num;

	ctx->srl_rx_lenght_param_addres = num + 1;
	ctx->srl_rx_lenght_param_modifier = 0;

	ctx->srl_rx_timeout_calc_started = 0;

	ctx->srl_rx_state = SRL_WAITING_TO_RX;
	ctx->srl_rx_waiting_start_time = master_time;

	ctx->srl_rx_term = 0;

	ctx->port->CR1 |= USART_CR1_RE;		// uruchamianie odbiornika
	ctx->port->CR1 |= USART_CR1_RXNEIE; // przerwanie od przepe�nionego bufora odbioru
	ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_IDLEIE);

	return SRL_OK;
}

/**
 * This function start the transfer with
 */
uint8_t srl_receive_data_with_instant_timeout (srl_context_t *ctx, int num, char start, char stop,
											   char echo, char len_addr, char len_modifier)
{
	if (ctx->srl_rx_state == SRL_RXING)
		return SRL_BUSY;

	if (num >= ctx->srl_rx_buf_ln)
		return SRL_DATA_TOO_LONG;

	memset (ctx->srl_rx_buf_pointer, 0x00, ctx->srl_rx_buf_ln);

	ctx->srl_rx_kiss_mode = 0;
	ctx->srl_rx_kiss_escaping_now = 0;

	// checking if user want
	if (start != 0x00) {
		ctx->srl_triggered_start = 1;
		ctx->srl_start_trigger = start;
	}
	else {
		ctx->srl_triggered_start = 0;
	}

	if (stop != 0x00) {
		ctx->srl_triggered_stop = 1;
		ctx->srl_stop_trigger = stop;
	}
	else {
		ctx->srl_triggered_stop = 0;
	}

	if (ctx->srl_triggered_start == 1 /*|| ctx->srl_triggered_stop == 1*/) {
		if (num < 3)
			return SRL_WRONG_PARAMS_COMBINATION;

		ctx->srl_rx_state = SRL_WAITING_TO_RX;
		ctx->srl_rx_waiting_start_time = master_time;
	}
	else {
		ctx->srl_rx_state = SRL_RXING;
	}

	ctx->srl_enable_echo = echo;
	ctx->srl_rx_bytes_counter = 0;
	ctx->srl_rx_bytes_req = num;

	if (len_addr != 0) {
		ctx->srl_rx_lenght_param_addres = len_addr;
	}
	else {
		ctx->srl_rx_lenght_param_addres = num + 1;
	}
	ctx->srl_rx_lenght_param_modifier = len_modifier;

	// set current time as receive start time
	ctx->srl_rx_start_time = master_time;

	ctx->srl_rx_timeout_calc_started = 1;

	ctx->port->CR1 |= USART_CR1_RE;		// uruchamianie odbiornika
	ctx->port->CR1 |= USART_CR1_RXNEIE; // przerwanie od przepe�nionego bufora odbioru
	// 	PORT->CR1 |= USART_CR1_IDLEIE;			// przerwanie od bezczynno�ci szyny RS przy odbiorze
	// spowodowanej zako�czeniem transmisji przez urz�dzenie
	return SRL_OK;
}

uint8_t srl_receive_data_with_callback (srl_context_t *ctx, srl_rx_termination_callback_t cbk)
{
	uint8_t retval = SRL_OK;

	if (ctx->srl_rx_state == SRL_RXING) {
		retval = SRL_BUSY;
	}
	else {
		// check if input pointers were set to something
		if (cbk == NULL || ctx == NULL) {
			retval = SRL_WRONG_PARAMS_COMBINATION;
		}
		else {
			ctx->srl_rx_kiss_mode = 0;
			ctx->srl_rx_kiss_escaping_now = 0;

			// set the callback pointer within the context
			ctx->srl_rx_term = cbk;

			// set the amount of bytes to be received as the size
			// of the receive buffer (minus one byte for safety).
			// it will be up to the callback function to terminate the receiving
			ctx->srl_rx_bytes_req = ctx->srl_rx_buf_ln - 1;

			// clear the rx buffer
			memset (ctx->srl_rx_buf_pointer, 0x00, ctx->srl_rx_buf_ln);

