SP8EBC/ParaTNC/system/src/drivers/l4/serial_stm32l4x.c
			ctx->srl_rx_bytes_counter = 0;

			ctx->srl_rx_lenght_param_addres = 0xFF;
			ctx->srl_rx_lenght_param_modifier = 0;

			ctx->srl_triggered_start = 0;
			ctx->srl_triggered_stop = 0;
			ctx->srl_enable_echo = 0;

			ctx->srl_rx_timeout_calc_started = 0;

			ctx->srl_rx_state = SRL_RXING;
			ctx->port->CR1 |= USART_CR1_RE; // uruchamianie odbiornika
			ctx->port->CR1 |= USART_CR1_RXNEIE;
			ctx->port->CR1 |= USART_CR1_IDLEIE;

			ctx->srl_rx_waiting_start_time = master_time;
			ctx->srl_rx_start_time = master_time;
		}
	}

	return retval;
}

void srl_irq_handler (srl_context_t *ctx)
{

	// local variable for recalculating a stream length (how many bytes the driver should receives)
	uint16_t len_temp = 0;

	// set to one if there are conditions to stop receiving
	uint8_t stop_rxing = 0;

	// local variable to store
	uint8_t value = 0;

	// if any data has been received by the UART controller
	if ((ctx->port->ISR & USART_ISR_RXNE) == USART_ISR_RXNE) {

		// increment the counter of received bytes
		ctx->total_rx_bytes++;

		switch (ctx->srl_rx_state) {
		case SRL_RXING: {

			ctx->srl_rx_start_time = master_time;

			// raise a flag to signalize that timeout shall be calulated from now.
			ctx->srl_rx_timeout_calc_started = 1;

			// disable the waiting timeout
			ctx->srl_rx_timeout_waiting_enable = 0;

			// if there is any data remaining to receive
			if (ctx->srl_rx_bytes_counter < ctx->srl_rx_bytes_req) {

				// get value from UART register
				value = (uint8_t)ctx->port->RDR;

				// if kiss mode is ative and escape character is received
				if (ctx->srl_rx_kiss_mode == 1 && value == FESC) {
					ctx->srl_rx_kiss_escaping_now = 1;
				}
				else { // if kiss protocol is not enabled or received character is not FESC

					// check if current byte is escaped
					if (ctx->srl_rx_kiss_escaping_now == 1) {
						switch (value) {
						case TFEND: value = FEND; break;
						case TFESC: value = FESC; break;
						default: stop_rxing = 1; break; // error situation, should be handled better
						}
					}

					// storing received byte into buffer
					ctx->srl_rx_buf_pointer[ctx->srl_rx_bytes_counter] = value;

					// check if termination callback pointer has been set
					if (ctx->srl_rx_term != NULL) {
						// if yes call it
						stop_rxing =
							ctx->srl_rx_term (ctx->srl_rx_buf_pointer[ctx->srl_rx_bytes_counter],
											  ctx->srl_rx_buf_pointer,
											  ctx->srl_rx_bytes_counter);

						// and check the return value
						if (stop_rxing == 1) {
							// if this was the last byte of transmission switch the state
							// of receiving part to done
							ctx->srl_rx_state = SRL_RX_DONE;

							ctx->srl_triggered_stop = 0;
						}
					}

					// checking if this byte in stream holds the protocol information about
					// how many bytes needs to be received.
					if (ctx->srl_rx_lenght_param_addres == ctx->srl_rx_bytes_counter &&
						ctx->srl_rx_lenght_param_addres != 0xFF) {
						len_temp = ctx->srl_rx_buf_pointer[ctx->srl_rx_bytes_counter];

						// adding (or substracting) a length modifier
						len_temp += ctx->srl_rx_lenght_param_modifier;

						// if the target length is bigger than buffer size switch to error state
						if (len_temp >= ctx->srl_rx_buf_ln) {
							ctx->srl_rx_error_reason = SRL_ERR_OVERFLOW;
							ctx->srl_rx_state = SRL_RX_ERROR;
							stop_rxing = 1;
						}
						else {
							ctx->srl_rx_bytes_req = len_temp;
						}
					}

					if (ctx->srl_rx_kiss_escaping_now == 0) {
						// if the user want the driver to stop receiving after certain is received
						if (ctx->srl_triggered_stop == 1) {
							if (value == ctx->srl_stop_trigger) {
								ctx->srl_rx_state = SRL_RX_DONE;
								stop_rxing = 1;
							}
						}
					}
					else {
						ctx->srl_rx_kiss_escaping_now = 0;
					}

					// moving buffer pointer forward
					ctx->srl_rx_bytes_counter++;
				}
			}
			////////////////////ssss

			// if after incrementing a pointer we reached the end of the buffer
			if (ctx->srl_rx_bytes_counter >= ctx->srl_rx_bytes_req) {

				// enabling a flag to disble receiver
				stop_rxing = 1;

				// setting a state to receive done
				ctx->srl_rx_state = SRL_RX_DONE;
			}

			if (stop_rxing == 1) {

				ctx->srl_rx_timeout_calc_started = 0;

				// disabling UART receiver and its interrupt
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_RE);
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_RXNEIE);
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_IDLEIE);

				if (ctx->srl_rx_done_or_error != 0) {
					ctx->srl_rx_done_or_error (ctx);
				}
			}

			break;
		}

		// the state when a driver is waiting for start character to appear on serial link
		case SRL_WAITING_TO_RX: {

			// storing the value of DR register into local variable to protect against data races
			// which may happened if this IT routine will be preempted by another (long) one
			value = (uint8_t)ctx->port->RDR;

			// checking if start character was received
			if (value == ctx->srl_start_trigger) {

				// storing received byte in buffer as firts one
				ctx->srl_rx_buf_pointer[ctx->srl_rx_bytes_counter] = value;

				// increasing the counter value
				ctx->srl_rx_bytes_counter++;

				// change state to receiving
				ctx->srl_rx_state = SRL_RXING;

				// as receiving is started there is no point to calculate waiting timeout
				ctx->srl_rx_timeout_waiting_enable = 0;

				ctx->srl_rx_start_time = master_time;

				// raise a flag to signalize that timeout shall be calulated from now.
				ctx->srl_rx_timeout_calc_started = 1;
			}
			else {
				// if this is not start byte just store it in garbage buffer to clear interrupt
				// condition
				ctx->srl_garbage_storage = value;
			}
			break;
		}
		default: break;
		}
	}

	if ((ctx->port->ISR & USART_ISR_IDLE) == USART_ISR_IDLE) {
		ctx->port->ICR |= USART_ICR_IDLECF;

