SP8EBC/ParaTNC/system/src/drivers/l4/serial_stm32l4x.c
		ctx->srl_garbage_storage = (uint8_t)ctx->port->RDR;

		ctx->total_idle_counter++;
	}

	// if overrun happened, a byte hadn't been transferred from DR before the next byte is received
	if ((ctx->port->ISR & USART_ISR_ORE) == USART_ISR_ORE) {
		ctx->port->ICR |= USART_ICR_ORECF;

		ctx->total_overrun_counter++;

		switch (ctx->srl_rx_state) {
		case SRL_RXING: ctx->srl_garbage_storage = (uint8_t)ctx->port->RDR; break;
		default:
			// if the UART driver is not receiving actually but hardware controler received any data
			// it is required to read value of DR register to clear the interrupt
			ctx->srl_garbage_storage = (uint8_t)ctx->port->RDR;
			break;
		}
	}

	if ((ctx->port->ISR & USART_ISR_TC) == USART_ISR_TC) {
		if (ctx->srl_tx_with_dma == 1) {
			switch (ctx->srl_tx_state) {
			case SRL_TXING: {
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_TE);
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_TXEIE);
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_TCIE);
				ctx->port->ICR |= USART_ICR_TCCF;
				ctx->srl_tx_state = SRL_TX_IDLE;

				// reset tx buffer pointer to internal one
				ctx->srl_tx_buf_pointer = ctx->srl_tx_internal_buf_pointer;
				ctx->srl_tx_buf_ln = ctx->srl_tx_internal_buf_ln;

				if (ctx->te_port != 0) {
					LL_GPIO_ResetOutputPin (ctx->te_port, ctx->te_pin);
				}

				if (ctx->srl_tx_done != 0) {
					ctx->srl_tx_done (ctx);
				}
				break;
			}
			default: break;
			}
		}
	}

	// if one byte was successfully transferred from DR to shift register for transmission over
	// USART
	if ((ctx->port->ISR & USART_ISR_TXE) == USART_ISR_TXE) {

		// increment the transmitted bytes counter
		ctx->total_tx_bytes++;

		switch (ctx->srl_tx_state) {
		case SRL_TXING:
			if (ctx->srl_tx_bytes_counter < ctx->srl_tx_bytes_req) {
				if (ctx->te_port != 0) {
					LL_GPIO_SetOutputPin (ctx->te_port, ctx->te_pin);
				}

				ctx->port->TDR = ctx->srl_tx_buf_pointer[ctx->srl_tx_bytes_counter++];
			}
			else {
				while ((ctx->port->ISR & USART_ISR_TC) != USART_ISR_TC)
					;
				ctx->port->CR1 &=
					(0xFFFFFFFF ^ USART_CR1_TE); // wyġṗczanie nadajnika portu szeregowego
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_TXEIE);
				ctx->port->CR1 &=
					(0xFFFFFFFF ^ USART_CR1_TCIE); // wyġṗczanie przerwañ od portu szeregowego
				ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
				ctx->srl_tx_state = SRL_TX_IDLE;

				// reset tx buffer pointer to internal one
				ctx->srl_tx_buf_pointer = ctx->srl_tx_internal_buf_pointer;
				ctx->srl_tx_buf_ln = ctx->srl_tx_internal_buf_ln;

				if (ctx->te_port != 0) {
					LL_GPIO_ResetOutputPin (ctx->te_port, ctx->te_pin);
				}
			}

			if (ctx->srl_tx_bytes_counter >= ctx->srl_tx_buf_ln ||
				ctx->srl_tx_bytes_req > ctx->srl_tx_buf_ln) {

				ctx->port->CR1 &=
					(0xFFFFFFFF ^ USART_CR1_TE); // wyġṗczanie nadajnika portu szeregowego
				ctx->port->CR1 &= (0xFFFFFFFF ^ USART_CR1_TXEIE);
				ctx->port->CR1 &=
					(0xFFFFFFFF ^ USART_CR1_TCIE); // wyġṗczanie przerwañ od portu szeregowego
				ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
				ctx->srl_tx_state = SRL_TX_IDLE;

				// reset tx buffer pointer to internal one
				ctx->srl_tx_buf_pointer = ctx->srl_tx_internal_buf_pointer;
				ctx->srl_tx_buf_ln = ctx->srl_tx_internal_buf_ln;

				if (ctx->te_port != 0) {
					LL_GPIO_ResetOutputPin (ctx->te_port, ctx->te_pin);
				}
			}

			if (ctx->srl_tx_done != 0) {
				if (ctx->srl_tx_state == SRL_TX_IDLE) {
					ctx->srl_tx_done (ctx);
				}
			}

			break;
		default: break;
		}
	}
}

void srl_irq_dma_handler (srl_context_t *ctx)
{
}

uint16_t srl_get_num_bytes_rxed (srl_context_t *ctx)
{
	return ctx->srl_rx_bytes_counter;
}

uint8_t *srl_get_rx_buffer (srl_context_t *ctx)
{
	return ctx->srl_rx_buf_pointer;
}

void srl_keep_tx_delay (srl_context_t *ctx)
{
	if (ctx != 0) {

		// check if pre tx delay is enabled by an user
		if (ctx->srl_tx_start_time != 0xFFFFFFFFu) {

			// if it is enabled then check if the serial port is currently set to waiting state
			if (ctx->srl_tx_state == SRL_TX_WAITING) {

				// check if a delay has expired
				if (main_get_master_time () - ctx->srl_tx_start_time >= SRL_TX_DELAY_IN_MS) {

					// if yes start the transmission
					ctx->port->CR1 |= USART_CR1_TE;
					ctx->port->ISR &= (0xFFFFFFFF ^ USART_ISR_TC);
					ctx->port->TDR = ctx->srl_tx_buf_pointer[0];

					ctx->srl_tx_bytes_counter = 1;

					ctx->srl_tx_state = SRL_TXING;

					ctx->port->CR1 |= USART_CR1_TXEIE;
					ctx->port->CR1 |= USART_CR1_TCIE;
				}
			}
		}
	}
}

void srl_switch_tx_delay (srl_context_t *ctx, uint8_t disable_enable)
{
	if (ctx != 0) {

		if (disable_enable == 1) {
			ctx->srl_tx_start_time = 0x0u;
		}
		else {
			ctx->srl_tx_start_time = 0xFFFFFFFFu;
		}
	}
}

/**
 * This function controls the timeout which is calculated for data reception (when the
 * state is set to SRL_RXING). The time starts ticking after the first byte appears in
 * data register, so this protect against stalling in the middle of data transfer
 */
void srl_switch_timeout (srl_context_t *ctx, uint8_t disable_enable, uint32_t value)
{
	if (disable_enable == 1)
		ctx->srl_rx_timeout_enable = 1;
	else if (disable_enable == 0)
		ctx->srl_rx_timeout_enable = 0;
	else {
		;
	}

	if (value != 0) {
		ctx->srl_rx_timeout_trigger_value_in_msec = value;
	}
	else {
		ctx->srl_rx_timeout_trigger_value_in_msec = SRL_DEFAULT_RX_TIMEOUT_IN_MS;
	}
}

/**
 * This function enables the timeout which is calculated for the waiting state for
 * the data reception to begin (the first byte on serial port). It must be called for
 * each RX transaction it is required as this timeout is cleared/disabled after the first
 * byte received by the serial port (when the state changes from SRL_WAITING_TO_RX to
 * SRL_RXING)
 */
void srl_switch_timeout_for_waiting (srl_context_t *ctx, uint8_t disable_enable)
{
	if (disable_enable == 1)
		ctx->srl_rx_timeout_waiting_enable = 1;
	else if (disable_enable == 0)
		ctx->srl_rx_timeout_waiting_enable = 0;
	else {
		;
	}

	if (ctx->srl_rx_timeout_trigger_value_in_msec == 0)
		ctx->srl_rx_timeout_trigger_value_in_msec = SRL_DEFAULT_RX_TIMEOUT_IN_MS;
}

void srl_set_done_error_callback (srl_context_t *ctx, srl_done_or_error_callback_t rx_callback,
								  srl_done_or_error_callback_t tx_done)
{
	ctx->srl_rx_done_or_error = rx_callback;
	ctx->srl_tx_done = tx_done;
}
